#include "SmartX3.h"
#include "math.h"
#include "ctype.h"
#include "string.h"
#include "stdlib.h"
/************************************************
*外部变量:	是应用软件中变量的映射,
*			其值的变化会反应到应用软件对应变量中.
************************************************/
extern int                src[5];


/************************************************
*全局变量:  本程序中使用的变量,
*			不支持定义时初始化,
*			需在主函数中初始化.
************************************************/
//此处定义全局变量(可不定义)


/************************************************
*主函数:  程序入口. 
************************************************/
int main(void)
{
    int j,i,n,temp;
	n = 5;
	for(i=0 ; i<n ; i++)
	 {
	  for(j=0 ; j<n-i-1 ; j++)
	  {
	   if(src[j]>src[j+1]) //Swapping Condition is Checked
	   {
		    temp=src[j];
		    src[j]=src[j+1];
		    src[j+1]=temp;
	   }
	  }
	}
  	return (0);
}
